30Sativa/fleet-management-system/robot/firmware/stm32/motor_controller/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32g4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define PA0___M1_STEP_Pin GPIO_PIN_0
#define PA0___M1_STEP_GPIO_Port GPIOA
#define PA1___M1_DIR_Pin GPIO_PIN_1
#define PA1___M1_DIR_GPIO_Port GPIOA
#define PA2___M2_STEP_Pin GPIO_PIN_2
#define PA2___M2_STEP_GPIO_Port GPIOA
#define PA3___M2_DIR_Pin GPIO_PIN_3
#define PA3___M2_DIR_GPIO_Port GPIOA
#define PB0_SONAR1_TRIG_Pin GPIO_PIN_0
#define PB0_SONAR1_TRIG_GPIO_Port GPIOB
#define PB1_SONAR1_ECHO_Pin GPIO_PIN_1
#define PB1_SONAR1_ECHO_GPIO_Port GPIOB
#define PB1_SONAR1_ECHO_EXTI_IRQn EXTI1_IRQn
#define PB11_SONAR2_TRIG_Pin GPIO_PIN_11
#define PB11_SONAR2_TRIG_GPIO_Port GPIOB
#define PB12_SONAR2_ECHO_Pin GPIO_PIN_12
#define PB12_SONAR2_ECHO_GPIO_Port GPIOB
#define PB12_SONAR2_ECHO_EXTI_IRQn EXTI15_10_IRQn
#define PB6___IMU_SCL_BITBANG_Pin GPIO_PIN_6
#define PB6___IMU_SCL_BITBANG_GPIO_Port GPIOB
#define PB7___IMU_SDA_BITBANG_Pin GPIO_PIN_7
#define PB7___IMU_SDA_BITBANG_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
